ads/ungerichtete_graphen.html
---
layout: page
title: Ungerichtete_graphen
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ungerichter Graph</h2>
<div class="outline-text-2" id="text-1">
<p>
Ein <i>ungerichteter Graph</i> \(G=(V,E)\) ist ein Paar aus einer endlichen
(nichtleeren) <i>Knotenmenge</i> \(V\) und einer <i>Kantenmenge</i>
\(E \subseteq \\{ \\{u,v\\} | u,v \in V \wedge u \neq v \\}\). Sei
\(e = \\{u,v\\} \in E\) eine Kante, dann sag man auch "\(e\) verbindet
Knoten \(u \in V\) und \(v \in V\)" oder "\(u\) und \(v\) sind inzident zu \(e\)"
oder auch "\(u\) und \(v\) sind adjazent".
</p>

<p>
<b>Pfad:</b> Ein <i>Pfad</i> (oder auch <i>Weg</i>) ist eine Folge von Knoten
\(P = (v_{1}, ..., v_{k+1})\), so dass
\(\forall i \in \{1,...,k\}: \\{v_{i}, v_{i+1}\\} \in E\) gilt.
</p>

<p>
<b>einfacher Pfad:</b> Ein Pfad \(P = (v_{1}, ..., v_{k+1})\) heißt <i>einfach</i>
(engl. <i>one-way</i>), wenn er keinen Knoten doppelt enthält, also
\(\forall i,j \in \\{1,..., k+1\\}: i \neq j \Rightarrow v_i \neq v_j\).
Einzig die Knotenwiederholung \(v_1 = v_{k+1}\) ist zulässig.
</p>

<p>
<b>einfacher Kreis:</b> Ein einfacher Pfad \(P = (v_1,...,v_{k+1})\) heißt
<i>einfacher Kreis</i>, wenn \(v_1 = v_{k+1}\) gilt und \(P\) mindestens 4 Knoten
enthält, also \(k \geq 3\) gilt .
</p>

<p>
<b>Kreis:</b> Ein Pfad \(P = (v_{1}, ..., v_{k+1})\) heißt <i>Kreis</i>, wenn
\(v_1 = v_{k+1}\) gilt und keine Kante in \(P\) doppelt vorkommt, also
\(\forall i, j \in \\{1,...,k\\}: i \neq j \Rightarrow \\{v_i, v_{i+1}\\} \neq \\{v_j, v_{j+1}\\}\).
</p>

<p>
Ein Graph \(G\) heißt <i>zusammenhängend</i>, wenn je zwei Knoten \(u,v \in V\)
durch einen Pfad in \(G\) verbunden sind, also für alle \(u,v \in V\) mit
\(u \neq v\) ein Pfad von \(u\) nach \(v\) in \(G\) existiert.
</p>

<p>
Ein Graph \(G\) heißt <i>kreisfrei</i>, wenn \(G\) keinen Kreis enthält.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Baum</h2>
<div class="outline-text-2" id="text-2">
<p>
Ein ungerichteter Graph, der zusammenhängend und kreisfrei ist, heißt
<i>Baum</i>.
</p>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>In einem Baum \(T = (V,E)\) gilt \(|E| = |V|-1\).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Grad eine Knotens</h2>
<div class="outline-text-2" id="text-3">
<p>
Der Grad \(d(v)\) eines Knotens \(v \in V\) ist die Anzahl der zu \(v\)
inzidenten Kanten. Also gilt
\(d(v) = | \\{ \\{x,y\\} | v \in \\{x,y\\} \\}|\).
</p>

<p>
Ein Knoten \(v \in V\) mit \(d(v) = 1\) heißt <i>Blatt</i>.
</p>

<p>
Ein Knoten \(v \in V\) mit \(d(v) = 0\) heißt <i>isolierter Knoten</i>.
</p>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>\(\sum_{v \in V} d(v) = |E|\)
</li>
<li>Die Anzahl der Knoten mit ungeraden Grad in einem Graphen \(G=(V,E)\)
   ist gerade.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Darstellung von ungerichteten Graphen</h2>
<div class="outline-text-2" id="text-4">
<p>
Sei \(G = (V,E)\) ungerichteter Graph, mit \(V = \\{v_0, .., v_{n-1}\\}\).
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Adjazenzmatrix</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>Idee:</b> Verwendung einer \(n \times n\) <i>Adjazenzmatrix</i> \(A\) mit:
</p>

<p>
$$A[i,j] = \begin{cases}
1 & \text{falls } \\{v_i, v_j\\} \in E \\
0 & \text{sonst}
\end{cases}$$
</p>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>Platzbedarf: \(\mathcal{O}(|V|^2)\).
</li>
<li>Test ob eine Kante \(\\{v_i, v_j\\}\) in \(E\) enthalten ist, ist in
\(\mathcal{O}(1)\) möglich.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Adjazenzlisten</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>Idee:</b> Für jeden Knoten v wird
\(Adj(v) = \\{u \in V | \\{v, u\\} \in E\\}\) als Liste gespeichert.
</p>

<p>
TODO: Bild
</p>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>Platzbedarf: \(\mathcal{O}(|V| + |E|)\)
</li>
<li>Test ob eine Kante \(\\{v_i, v_j\\}\) in \(E\) enthalten ist, ist in
\(\mathcal{O}(|V|)\) möglich.
</li>
</ul>
</div>
</div>
</div>
